app/controllers/dealer_details_controller.rb

SELECT "dealer_details".* FROM "dealer_details"
---
    def index
        @dealers = DealerDetail.all

SELECT "dealer_details".* FROM "dealer_details" WHERE "dealer_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_dealer
        @dealerDetail = DealerDetail.find_by(id: params['id'])