app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "sample title"], ["description", "sample description"], ["created_at", "2024-05-23 18:41:40.792157"], ["updated_at", "2024-05-23 18:41:40.792157"]]
---
    def create
        @product = Product.new(product_params)
        if @product.save

UPDATE "products" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "sample title"], ["description", "sample description"], ["updated_at", "2024-05-23 21:04:50.083137"], ["id", 1]]
---
    def update
        if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
    def destroy
        if @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_product
        @product = Product.find_by(id: params[:id])